<a href="https://colab.research.google.com/github/gtzambranop/UN_2020_2/blob/DCD/DCD/module_2_francisco/Clase_6_Python_b%C3%A1sico.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd 
import numpy as np

Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})


Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento': [31, 33, 34, 35]})

In [ ]:
print(Empleado)
print('-' * 50)
print(Departamento)

    Apellido  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
--------------------------------------------------
  NombreDepartamento  IDDepartamento
0             Ventas              31
1         Ingeniería              33
2         Producción              34
3           Mercadeo              35

In [ ]:
pd.merge(Empleado, Departamento) # La columna IDDepartamento solo queda una vez

Empleado.merge(Departamento) # Forma alterna

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción

In [ ]:
df_merged = pd.merge(Empleado, Departamento, how='left')

In [ ]:
df_merged

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5     Gaspar              36                NaN

In [ ]:
pd.merge(Empleado, Departamento, how='right')

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5        NaN              35           Mercadeo

Poner comentario

In [ ]:
dc = {'a':1}

In [ ]:
dc.update({'b':1})

In [ ]:
dc

{'a': 1, 'b': 1}

In [ ]:
pd.merge(Empleado, Departamento, how='outer')

    Apellido  IDDepartamento NombreDepartamento
0    Andrade              31             Ventas
1     Jordán              33         Ingeniería
2  Steinberg              33         Ingeniería
3   Róbinson              34         Producción
4     Zolano              34         Producción
5     Gaspar              36                NaN
6        NaN              35           Mercadeo

In [ ]:
df_merged = pd.merge(Empleado, Departamento, how='outer') 
df_merged[np.logical_or(df_merged.Apellido.isna(), df_merged.NombreDepartamento.isna())]

  Apellido  IDDepartamento NombreDepartamento
5   Gaspar              36                NaN
6      NaN              35           Mercadeo

In [ ]:
lst1 = np.array([True, True, False, False])
lst2 = np.array([True, False, True, False])
np.logical_or(lst1, lst2)

array([ True,  True,  True, False])

In [ ]:
# Decidir la columna por la cual se hace el join explicitamente

Empleado.columns = ['Nombre', 'IDDepartamento']
Departamento.columns = ['Nombre', 'IDDepartamento']

print(Empleado)
print('-' * 50)
print(Departamento)

#pd.merge(Empleado, Departamento) 
pd.merge(Empleado, Departamento, on='IDDepartamento') # En caso de haber múltiples columnas que hagan match

      Nombre  IDDepartamento
0    Andrade              31
1     Jordán              33
2  Steinberg              33
3   Róbinson              34
4     Zolano              34
5     Gaspar              36
--------------------------------------------------
       Nombre  IDDepartamento
0      Ventas              31
1  Ingeniería              33
2  Producción              34
3    Mercadeo              35

    Nombre_x  IDDepartamento    Nombre_y
0    Andrade              31      Ventas
1     Jordán              33  Ingeniería
2  Steinberg              33  Ingeniería
3   Róbinson              34  Producción
4     Zolano              34  Producción

In [ ]:
# Prefijos para distiguir variables

pd.merge(Empleado, Departamento, on='IDDepartamento', suffixes=('_emp','_dep')) # Sufijo personalizado

  Nombre_emp  IDDepartamento  Nombre_dep
0    Andrade              31      Ventas
1     Jordán              33  Ingeniería
2  Steinberg              33  Ingeniería
3   Róbinson              34  Producción
4     Zolano              34  Producción

In [ ]:
# Columnas para match con diferente nombre
Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})


Departamento = pd.DataFrame({'NombreDepartamento': ['Ventas', 'Ingeniería', 'Producción', 'Mercadeo'],
                             'IDDepartamento2': [31, 33, 34, 35]})

#pd.merge(Empleado, Departamento)
pd.merge(Empleado, Departamento, left_on='IDDepartamento', right_on='IDDepartamento2')

    Apellido  IDDepartamento NombreDepartamento  IDDepartamento2
0    Andrade              31             Ventas               31
1     Jordán              33         Ingeniería               33
2  Steinberg              33         Ingeniería               33
3   Róbinson              34         Producción               34
4     Zolano              34         Producción               34

In [ ]:
Empleado2 = Empleado.copy()
Empleado2.index = Empleado2.IDDepartamento
#Empleado2
Departamento2 = Departamento.copy()
Departamento2.index = Departamento2.IDDepartamento2

Empleado2 = Empleado2[['Apellido']]
Departamento2 = Departamento2[['NombreDepartamento']]
Empleado2
# Departamento2

pd.merge(Empleado2, Departamento2, left_index=True, right_index=True)

     Apellido NombreDepartamento
31    Andrade             Ventas
33     Jordán         Ingeniería
33  Steinberg         Ingeniería
34   Róbinson         Producción
34     Zolano         Producción

In [ ]:
pd.DataFrame({'a':[1,2], 'b':[3,4]})

   a  b
0  1  3
1  2  4

In [ ]:
Empleado2.loc[33]

                 Apellido
IDDepartamento
33                 Jordán
33              Steinberg

In [ ]:
# Añadir columna

Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
Empleado
nombres = ['Francisco', 'Edgar', 'Marta', 'Luciana', 'David', 'María']
edad = [1,2,3,4,5,6]

# Asignación creando un objeto nuevo
Empleado2 = Empleado.assign(Nombre=nombres)
Empleado2 = Empleado2.assign(Edad=edad)
Empleado2
#Empleado


# Asignación modificando el objeto original
#Empleado['Nombre'] = nombres
#Empleado

    Apellido  IDDepartamento     Nombre  Edad
0    Andrade              31  Francisco     1
1     Jordán              33      Edgar     2
2  Steinberg              33      Marta     3
3   Róbinson              34    Luciana     4
4     Zolano              34      David     5
5     Gaspar              36      María     6

In [ ]:
Empleado.columns

Index(['Apellido', 'IDDepartamento'], dtype='object')

In [ ]:
# Añadir fila

Empleado = pd.DataFrame({'Apellido' : ['Andrade', 'Jordán', 'Steinberg', 'Róbinson', 'Zolano', 'Gaspar'],
                         'IDDepartamento' : [31, 33, 33, 34, 34, 36]})
#nuevo_empleado = [('Ospina', 33)]
#nuevo_empleado = [{'Apellido': 'Ospina', 'IDDepartamento': 33}]
nuevo_empleado = pd.Series(['Ospina', 37], index=['Apellido', 'IDDepartamento'])

# Asignación creando un objeto nuevo
#Empleado2 = Empleado.append(nuevo_empleado, ignore_index=True)
#Empleado2
#Empleado


# Asignación modificando el objeto original
#Empleado.loc[6] = ['Ospina', 37]
#Empleado

In [ ]:
Empleado['Edad'] = [20,23,45,48,56,32]

Empleado['Edad_meses'] = Empleado['Edad'] * 12

Empleado

    Apellido  IDDepartamento  Edad  Edad_meses
0    Andrade              31    20         240
1     Jordán              33    23         276
2  Steinberg              33    45         540
3   Róbinson              34    48         576
4     Zolano              34    56         672
5     Gaspar              36    32         384

In [ ]:
df_merge = pd.merge(Empleado, Departamento, how='left', left_on='IDDepartamento', right_on='IDDepartamento2')

str_list = []

# Se crea una nueva variable y se añade como una columna
for index, row in df_merge.iterrows():
    str_list.append('El empleado {} trabaja en el departamento de {}'.format(row['Apellido'], 
                                                                             row['IDDepartamento']))

#str_list   
df_merge['Comentario'] = str_list
df_merge

    Apellido  ...                                         Comentario
0    Andrade  ...  El empleado Andrade trabaja en el departamento...
1     Jordán  ...  El empleado Jordán trabaja en el departamento ...
2  Steinberg  ...  El empleado Steinberg trabaja en el departamen...
3   Róbinson  ...  El empleado Róbinson trabaja en el departament...
4     Zolano  ...  El empleado Zolano trabaja en el departamento ...
5     Gaspar  ...  El empleado Gaspar trabaja en el departamento ...

[6 rows x 7 columns]

In [ ]:
#for tup in df_merge.iterrows():
#  print(tup)

In [ ]:
Ser1 = pd.Series([1,2], index=['a', 'b'])
Ser2 = pd.Series([2,3,4,5], index=['a', 'b', 'c', 'd'])

#pd.concat([Ser1, Ser2])
pd.concat([Ser1, Ser2], axis=1)

     0  1
a  1.0  2
b  2.0  3
c  NaN  4
d  NaN  5

In [ ]:
df1 = pd.DataFrame({'var_1': [1,2], 'var_2': [3,4]})
df2 = pd.DataFrame({'var_3': [5,6], 'var_2': [7,8]})
df2

#pd.concat([df1, df2])
pd.concat([df1, df2], axis=1) # Es importante renombrar columnas

   var_1  var_2  var_3  var_2
0      1      3      5      7
1      2      4      6      8

In [ ]:
#df3[['var_1', 'var_3']]

In [ ]:
import numpy as np
import pandas as pd

# Duplicando indices

valor = np.random.randint(20, size=10)

df_ventas = pd.DataFrame({'Oficina': [1,1,1,2,2,2,3,3,3,3],
                          'Producto': ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d'],
                          'Valor':valor})
df_ventas
df_ventas[df_ventas['Oficina'] == 1]#
#df_ventas[df_ventas['Oficina'].isin([1,2])]

# Sin duplicar indices

df_ventas2 = pd.DataFrame({'Valor': valor}, 
                         index=[[1,1,1,2,2,2,3,3,3,3], 
                                ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d']])
df_ventas2 = df_ventas2.rename_axis(['Oficina','Producto'])
#df_ventas2
df_ventas2.loc[1]
df_ventas2.loc[1:2]

                  Valor
Oficina Producto
1       a             1
        b            10
        c            16
2       a             0
        b             6
        c             4

In [ ]:
#df_ventas
df_ventas3 = df_ventas2.swaplevel('Oficina','Producto')
df_ventas3
df_ventas3.loc['a']

         Valor
Oficina
1            1
2            0
3            3

In [ ]:
#df_ventas2.sum(level='Oficina')
df_ventas2.sum(level='Producto')

          Valor
Producto
a             4
b            27
c            30
d            16

In [ ]:
df_ventas = pd.DataFrame({'Oficina': [1,1,1,2,2,2,3,3,3,3],
                          'Producto': ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d'],
                          'Valor': valor})

#df_ventas
df_ventas.pivot(index='Oficina', columns='Producto', values='Valor')

Producto    a     b     c     d
Oficina
1         1.0  10.0  16.0   NaN
2         0.0   6.0   4.0   NaN
3         3.0  11.0  10.0  16.0

In [ ]:
df_ventas['Producto']

#df_ventas[['Producto', 'Valor']]

df_ventas[['Producto']]

  Producto
0        a
1        b
2        c
3        a
4        b
5        c
6        a
7        b
8        c
9        d

In [ ]:
Empleado
Empleado.sort_values(by='IDDepartamento')

Empleado.sort_values(by='IDDepartamento', ascending=False)

Empleado.sort_values(by=['IDDepartamento', 'Apellido'], ascending=[False, False])

    Apellido  IDDepartamento  Edad  Edad_meses
5     Gaspar              36    32         384
4     Zolano              34    56         672
3   Róbinson              34    48         576
2  Steinberg              33    45         540
1     Jordán              33    23         276
0    Andrade              31    20         240

In [ ]:
Empleado.T

                      0       1          2         3       4       5
Apellido        Andrade  Jordán  Steinberg  Róbinson  Zolano  Gaspar
IDDepartamento       31      33         33        34      34      36
Edad                 20      23         45        48      56      32
Edad_meses          240     276        540       576     672     384

In [ ]:
for key, value in Empleado.groupby('IDDepartamento'):
    print('-' * 50)
    print('IDDepartamento = {}'.format(key))
    print('+' * 20)
    print('DataFrame:')
    print(value)

--------------------------------------------------
IDDepartamento = 31
++++++++++++++++++++
DataFrame:
  Apellido  IDDepartamento  Edad  Edad_meses
0  Andrade              31    20         240
--------------------------------------------------
IDDepartamento = 33
++++++++++++++++++++
DataFrame:
    Apellido  IDDepartamento  Edad  Edad_meses
1     Jordán              33    23         276
2  Steinberg              33    45         540
--------------------------------------------------
IDDepartamento = 34
++++++++++++++++++++
DataFrame:
   Apellido  IDDepartamento  Edad  Edad_meses
3  Róbinson              34    48         576
4    Zolano              34    56         672
--------------------------------------------------
IDDepartamento = 36
++++++++++++++++++++
DataFrame:
  Apellido  IDDepartamento  Edad  Edad_meses
5   Gaspar              36    32         384

In [ ]:
for key, group in Empleado.groupby('IDDepartamento')['Apellido']:
    print('-' * 50)
    print('IDDepartamento = {}'.format(key))
    print('DataFrame:')
    print(group)

--------------------------------------------------
IDDepartamento = 31
DataFrame:
0    Andrade
Name: Apellido, dtype: object
--------------------------------------------------
IDDepartamento = 33
DataFrame:
1       Jordán
2    Steinberg
Name: Apellido, dtype: object
--------------------------------------------------
IDDepartamento = 34
DataFrame:
3    Róbinson
4      Zolano
Name: Apellido, dtype: object
--------------------------------------------------
IDDepartamento = 36
DataFrame:
5    Gaspar
Name: Apellido, dtype: object

In [ ]:
df_ventas = pd.DataFrame({'Oficina': np.random.choice([1, 2, 3], 50),
                          'Producto': np.random.choice(['a','b','c','d','e'], 50),
                          'Valor': np.random.randint(5,50, size=50) * 1000})
df_ventas

    Oficina Producto  Valor
0         2        e  45000
1         3        b  11000
2         2        a  21000
3         2        e  13000
4         2        d  17000
5         2        b  43000
6         3        e  41000
7         3        d  31000
8         2        a  38000
9         2        a  44000
10        1        b  22000
11        2        b  24000
12        2        c   8000
13        3        e  45000
14        1        c  10000
15        2        b   6000
16        2        b  33000
17        1        e  24000
18        3        c  49000
19        3        c  12000
20        1        a   5000
21        3        a  41000
22        1        e  47000
23        1        b  26000
24        2        c  37000
25        2        e  22000
26        3        d  13000
27        1        e  28000
28        2        b  10000
29        1        b  25000
30        3        c  25000
31        2        b  25000
32        2        e  35000
33        2        d  23000
34        2        a  33000
35        2        d  21000
36        3        a  22000
37        1        d  43000
38        3        a  42000
39        2        e  12000
40        3        b  25000
41        3        d   7000
42        1        e  14000
43        3        a   9000
44        1        e  11000
45        1        a  38000
46        3        a  18000
47        3        c  38000
48        3        a  46000
49        1        d  22000

In [ ]:
df_ventas.groupby(['Oficina', 'Producto']).mean()

                         Valor
Oficina Producto
1       a         21500.000000
        b         24333.333333
        c         10000.000000
        d         32500.000000
        e         24800.000000
2       a         34000.000000
        b         23500.000000
        c         22500.000000
        d         20333.333333
        e         25400.000000
3       a         29666.666667
        b         18000.000000
        c         31000.000000
        d         17000.000000
        e         43000.000000

In [ ]:
#pd.crosstab(df_ventas['Oficina'], df_ventas['Producto'])

pd.crosstab(df_ventas['Oficina'], df_ventas['Producto'], margins=True, normalize=True)

Producto     a     b     c     d     e   All
Oficina
1         0.04  0.06  0.02  0.04  0.10  0.26
2         0.08  0.12  0.04  0.06  0.10  0.40
3         0.12  0.04  0.08  0.06  0.04  0.34
All       0.24  0.22  0.14  0.16  0.24  1.00

In [ ]:
! wget https://www.dropbox.com/s/z4zoofdgdrxe01r/movies.csv
! wget https://www.dropbox.com/s/f328xczt6vju6hi/ratings.csv

--2020-09-27 05:57:30--  https://www.dropbox.com/s/z4zoofdgdrxe01r/movies.csv
Resolving www.dropbox.com (www.dropbox.com)... 162.125.5.1, 2620:100:601d:1::a27d:501
Connecting to www.dropbox.com (www.dropbox.com)|162.125.5.1|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/z4zoofdgdrxe01r/movies.csv [following]
--2020-09-27 05:57:31--  https://www.dropbox.com/s/raw/z4zoofdgdrxe01r/movies.csv
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://uc40dabbc9911c7b98e3ceaadd04.dl.dropboxusercontent.com/cd/0/inline/BALcvsubC3WyZ1NcX5lJL4jnRQ97w0VtBRLareHA0P8JH9bmlo4iZLErTlKbfx-th_Mr8uU0XfExWDmjBPhnKMeoOc9vHLGlmX9v0en_9bJP1nRCzlvEz-5-2fWlv6_0VIE/file# [following]
--2020-09-27 05:57:31--  https://uc40dabbc9911c7b98e3ceaadd04.dl.dropboxusercontent.com/cd/0/inline/BALcvsubC3WyZ1NcX5lJL4jnRQ97w0VtBRLareHA0P8JH9bmlo4iZLErTlKbfx-th_Mr8uU0XfExWDmjBPhnKMeoOc9vHLGlmX9v0en_9bJP1nRCzlvEz-5-2fWlv6_0VIE/file
Resolving uc40dabbc9911c7b98e3ceaadd04.dl.dropboxusercontent.com (uc40dabbc9911c7b98e3ceaadd04.dl.dropboxusercontent.com)... 162.125.5.15, 2620:100:601d:15::a27d:50f
Connecting to uc40dabbc9911c7b98e3ceaadd04.dl.dropboxusercontent.com (uc40dabbc9911c7b98e3ceaadd04.dl.dropboxusercontent.com)|162.125.5.15|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 494431 (483K) [text/plain]
Saving to: ‘movies.csv’

movies.csv          100%[===================>] 482.84K  --.-KB/s    in 0.1s

2020-09-27 05:57:32 (4.23 MB/s) - ‘movies.csv’ saved [494431/494431]

--2020-09-27 05:57:32--  https://www.dropbox.com/s/f328xczt6vju6hi/ratings.csv
Resolving www.dropbox.com (www.dropbox.com)... 162.125.5.1, 2620:100:601d:1::a27d:501
Connecting to www.dropbox.com (www.dropbox.com)|162.125.5.1|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/f328xczt6vju6hi/ratings.csv [following]
--2020-09-27 05:57:32--  https://www.dropbox.com/s/raw/f328xczt6vju6hi/ratings.csv
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://uce1eafbb27f28ecc17622ed7810.dl.dropboxusercontent.com/cd/0/inline/BAItlhN8z0-QkpYvZ2o9IMJ8iT5XBL1eEpcgjYD-kHPAtoGs_V2ifyqpc9InvwQwG58DJNWXd_nQuxs2sC1-AWXvICnWvWHCLgXmxl45FmDYn6_t84ixMkbhGAKgIjSP5JM/file# [following]
--2020-09-27 05:57:32--  https://uce1eafbb27f28ecc17622ed7810.dl.dropboxusercontent.com/cd/0/inline/BAItlhN8z0-QkpYvZ2o9IMJ8iT5XBL1eEpcgjYD-kHPAtoGs_V2ifyqpc9InvwQwG58DJNWXd_nQuxs2sC1-AWXvICnWvWHCLgXmxl45FmDYn6_t84ixMkbhGAKgIjSP5JM/file
Resolving uce1eafbb27f28ecc17622ed7810.dl.dropboxusercontent.com (uce1eafbb27f28ecc17622ed7810.dl.dropboxusercontent.com)... 162.125.5.15, 2620:100:601d:15::a27d:50f
Connecting to uce1eafbb27f28ecc17622ed7810.dl.dropboxusercontent.com (uce1eafbb27f28ecc17622ed7810.dl.dropboxusercontent.com)|162.125.5.15|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 2483723 (2.4M) [text/plain]
Saving to: ‘ratings.csv’

ratings.csv         100%[===================>]   2.37M  13.6MB/s    in 0.2s

2020-09-27 05:57:33 (13.6 MB/s) - ‘ratings.csv’ saved [2483723/2483723]

In [ ]:
import pandas as pd

df_movies = pd.read_csv('movies.csv')
df_ratings = pd.read_csv('ratings.csv')

In [ ]:
df_movies.head()
df_movies.shape

(9742, 3)

In [ ]:
df_ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [ ]:
df_ratings.shape

(100836, 4)

In [ ]:
lista = [1,2,3,4,5,6]
{'persona':{'nombre':'aa', 'Apellido': 'aa','telefonos':{'movil':[1,2,5,4,6,8], 'fijo':[2,5,6]}}}

{'persona': {'Apellido': 'aa',
  'nombre': 'aa',
  'telefonos': {'fijo': [2, 5, 6], 'movil': [1, 2, 5, 4, 6, 8]}}}

In [ ]:
dt_ratings_trunc  = df_ratings.head()

In [ ]:
dt_ratings_trunc.to_dict()

{'movieId': {0: 1, 1: 3, 2: 6, 3: 47, 4: 50},
 'rating': {0: 4.0, 1: 4.0, 2: 4.0, 3: 5.0, 4: 5.0},
 'timestamp': {0: 964982703,
  1: 964981247,
  2: 964982224,
  3: 964983815,
  4: 964982931},
 'userId': {0: 1, 1: 1, 2: 1, 3: 1, 4: 1}}

In [ ]:
import numpy as np
import pandas as pd

# Duplicando indices

df_ventas = pd.DataFrame({'Oficina': [1,1,1,2,2,2,3,3,3,3],
                          'Producto': ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d'],
                          'Valor': np.random.randint(20, size=10)})
df_ventas
# df_ventas[df_ventas['Oficina'] == 1]

df_ventas[df_ventas['Oficina'].isin([1,2])]

# Sin duplicar indices

df_ventas2 = pd.DataFrame({'Valor': np.random.random(10)}, 
                         index=[[1,1,1,2,2,2,3,3,3,3], 
                                ['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c','d']])
df_ventas2 = df_ventas2.rename_axis(['Oficina','Producto'])
df_ventas2
#df_ventas2.loc[1]
df_ventas2.loc[1:2]

                     Valor
Oficina Producto
1       a         0.841909
        b         0.245543
        c         0.267570
2       a         0.365439
        b         0.503971
        c         0.776845

In [ ]:
df_ventas[df_ventas['Oficina'].isin([1,2])]

   Oficina Producto  Valor
0        1        a     13
1        1        b     16
2        1        c     13
3        2        a     17
4        2        b      6
5        2        c     14